pokecollector/app/controllers/cards_controller.rb

INSERT INTO "cards" ("card_name", "card_type", "card_image", "set", "card_price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create #changed to automatically assign the User ID when creating cards, so I removed the User portion from the form
    @card = current_user.cards.build(card_params) # Automatically assign the user
    if @card.save

UPDATE "cards" SET "card_type" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["card_type", "Psychic"], ["updated_at", "2024-11-29 20:01:22.460791"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @card.update(card_params)

DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 2]]
---
  def destroy
    @card.destroy!

SELECT "cards".* FROM "cards" WHERE (card_name LIKE '%chari%')
SELECT 1 AS one FROM "cards" WHERE (card_name ILIKE '%charizard%') AND (set ILIKE '%base%') AND (card_type ILIKE '%fire%') LIMIT ?  [["LIMIT", 1]]
SELECT "cards".* FROM "cards" WHERE (card_name LIKE '%charizard%') AND (`set` LIKE '%base%') AND (card_type LIKE '%fire%')
SELECT 1 AS one FROM "cards" WHERE (card_name LIKE '%charizard%') AND (`set` LIKE '%base%') AND (card_type LIKE '%fire%') LIMIT ?  [["LIMIT", 1]]
---
  def search
    @cards = Card.all

    # `LIKE` is a case insensitve search operator. allows for 'pikachu', 'PIKACHU', and 'pIkAcHu' to all find the same card in the DB of 'Pikachu'
    # `%#{params[:x]}%` allow for partial string matching. if params[:card_name] == 'pika', the query would pull every card that contained 'Pika' in it
    @cards = @cards.where('card_name LIKE ?', "%#{params[:card_name]}%") if params[:card_name].present?
    @cards = @cards.where('`set` LIKE ?', "%#{params[:set]}%") if params[:set].present?