pokecollector/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show #Wanted to show the cards a user owns/created in their account page
    @user = User.find(params[:id]) # Find user by ID from URL

UPDATE "users" SET "first_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "chase"], ["updated_at", "2024-11-21 06:01:32.258324"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)